---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudEngineRegistry.IsEngineFileBased(System.String)
source: html/7f60b41d-0ef2-9fda-51dd-4c5da0441381.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudEngineRegistry.IsEngineFileBased Method

Identifies if a given engine is file-based.

## Syntax (C#)
```csharp
public static bool IsEngineFileBased(
	string identifier
)
```

## Parameters
- **identifier** (`System.String`) - The engine identifier.

## Returns
True if the engine is file-based, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null